Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------
# Full pipeline: mesh + solve (case 1-A).
#------------------------------------------------------------------------------

./buildMesh
./Run

#------------------------------------------------------------------------------
