system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Case 1-A mesh settings (25 deg Ahmed body)

castellatedMesh true;
snap            true;
addLayers       true;


geometry
{
    ahmed_25deg_m.stl
    {
        type triSurfaceMesh;
        name ahmed_body;
    }

    refinementBox_1
    {
        type box;
        min (-1.0 -0.7 0.0);
        max ( 8.0  0.7 2.5);
    }

    refinementBox_2
    {
        type box;
        min (-0.7 -0.6 0.0);
        max ( 4.0  0.6 1.5);
    }

    refinementBox_3
    {
        type box;
        min (-0.5 -0.5 0.0);
        max ( 2.0  0.5 0.8);
    }
}


castellatedMeshControls
{
    maxLocalCells 5000000;
    maxGlobalCells 30000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 3;

    features
    (
        {
            file "ahmed_25deg_m.eMesh";
            level 8;
        }
    );

    refinementSurfaces
    {
        ahmed_body
        {
            level (5 6);
            patchInfo
            {
                type wall;
                inGroups (ahmed_bodyGroup);
            }
        }
    }

    refinementRegions
    {
        ahmed_body
        {
            mode distance;
            levels ((0.025 6) (0.1 5));
        }

        refinementBox_1
        {
            mode inside;
            levels ((1E15 3));
        }

        refinementBox_2
        {
            mode inside;
            levels ((1E15 4));
        }

        refinementBox_3
        {
            mode inside;
            levels ((1E15 5));
        }
    }

    resolveFeatureAngle 30;
    locationInMesh (3.0001 3.0001 0.43);
    allowFreeStandingZoneFaces true;
}


snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}


addLayersControls
{
    relativeSizes true;

    layers
    {
        lowerWall
        {
            nSurfaceLayers 5;
        }

        ahmed_body
        {
            nSurfaceLayers 10;
        }
    }

    expansionRatio 1.0;
    firstLayerThickness 0.05;
    minThickness 0.05;
    nGrow 0;
    featureAngle 60;
    slipFeatureAngle 30;
    nRelaxIter 3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}


meshQualityControls
{
    #include "meshQualityDict"

    nSmoothScale 4;
    errorReduction 0.75;
}


writeFlags
(
    scalarLevels
    layerSets
    layerFields
);


mergeTolerance 1e-6;


// ************************************************************************* //
