system/streamLines
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

streamLines
{
    type    streamLine;
    libs    (fieldFunctionObjects);

    writeControl    writeTime;

    setFormat   vtk;

    direction   forward;

    fields      (p U k);

    lifeTime    10000;

    nSubCycle   5;

    cloud       particleTracks;

    seedSampleSet
    {
        type        uniform;
        axis        x;

        // Note: tracks slightly offset so as not to be on a face
        start       (-1.001 -0.05 0.0011);
        end         (-1.001 -0.05 1.0011);
        nPoints     20;
    }
}


// ************************************************************************* //
