system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ahmed_25deg_m.stl
{
    extractionMethod    extractFromSurface;

    // Original case 1-A used includedAngle 178
    includedAngle       178;

    subsetFeatures
    {
        nonManifoldEdges       no;
        openEdges              yes;
    }

    writeObj            yes;
}


// ************************************************************************* //
